app/controllers/home_controller.rb

  def video
    if params[:id].nil?
      redirect_to :action => :stories
    end

    @stories = Story.find(:all, :conditions => "youtube_id IS NOT NULL", :order => "first_name")
    @story = Story.find(:first, :conditions => ["youtube_id IS NOT NULL AND id = ?", params[:id]])
    @story = @stories.first if @story.nil?
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)
SELECT * FROM `stories` LIMIT 1

  def from
    @stories = Story.find(:all, :conditions => ["youtube_id IS NOT NULL AND (REPLACE(city, ' ', '') = ? OR city = ?)", params[:id], params[:id]], :order => "first_name")
    @description = "Hear health care stories from people in #{@stories.first.city}, #{@stories.first.state}."
---
SELECT * FROM `stories` WHERE (id = 'fresnoa') LIMIT 1
SELECT * FROM `stories` LIMIT 1

  def tag
    @tag = Tag.find(:all, :conditions => ["tags.name = ?", params[:id]])
    if @tag.empty?
      redirect_to :action => :index and return
    end

    @stories = Story.find(:all, :conditions => ["youtube_id IS NOT NULL AND tags.name = ?", params[:id]], :include => "tags", :order => "first_name")
---
SELECT * FROM `tags` INNER JOIN `stories_tags` ON `tags`.id = `stories_tags`.tag_id WHERE (`stories_tags`.story_id = 1 )

  def browser
    if params[:q] == "tag"
      @stories = Story.find(:all, :conditions => ["youtube_id IS NOT NULL AND tags.name = ?", params[:id]], :include => "tags", :order => "first_name")
    elsif params[:q] == "from"
      @stories = Story.find(:all, :conditions => ["youtube_id IS NOT NULL AND city = ?", params[:id]], :order => "first_name")
    end

    @stories = Story.all if @stories.empty?
---
SELECT * FROM `stories` WHERE (city = 'x')
SELECT * FROM `stories`