app/controllers/home_controller.rb

SELECT * FROM `stories` WHERE (id = '2') LIMIT 1
---
  def story
    if params[:id].nil?
      @story = Story.first